## Import Libraries needed:

In [245]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import plotly.express as px

## import tables:

In [248]:
table_1 = pd.read_csv("../data/raw/df_final_demo.txt")
table_2 = pd.read_csv("../data/raw/df_final_experiment_clients.txt")
df_1 = pd.read_csv("../data/raw/df_final_web_data_pt_1.txt")
df_2 = pd.read_csv("../data/raw/df_final_web_data_pt_2.txt")

## Analyse table:

In [251]:
# initial table analysis to get familiar
display(table_1.head(), f"Table shape: {table_1.shape}", table_1.dtypes)

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

'Table shape: (70609, 9)'

client_id             int64
clnt_tenure_yr      float64
clnt_tenure_mnth    float64
clnt_age            float64
gendr                object
num_accts           float64
bal                 float64
calls_6_mnth        float64
logons_6_mnth       float64
dtype: object

In [253]:
# initial table analysis to get familiar
display(table_2.head(), f"Table shape: {table_2.shape}", table_2.dtypes)

   client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

'Table shape: (70609, 2)'

client_id     int64
Variation    object
dtype: object

In [255]:
# initial table analysis to get familiar
display(df_1.head(), f"Table shape: {df_1.shape}", df_1.dtypes) #date time should change to date format

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

'Table shape: (343141, 5)'

client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object

In [257]:
# initial table analysis to get familiar
display(df_2.head(), f"Table shape: {df_2.shape}", df_2.dtypes) #date time should change to date format

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58

'Table shape: (412264, 5)'

client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object

In [259]:
table_1.isna().sum()

client_id            0
clnt_tenure_yr      14
clnt_tenure_mnth    14
clnt_age            15
gendr               14
num_accts           14
bal                 14
calls_6_mnth        14
logons_6_mnth       14
dtype: int64

In [261]:
table_2.isna().sum()# 20k NAN to check

client_id        0
Variation    20109
dtype: int64

## Start working on tables:

In [264]:
#join df_1 & df_2 table into table_3
table_3 = pd.concat([df_1, df_2], axis=0)
display(table_3)

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04
...,...,...,...,...,...
412259,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10
412260,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29
412261,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51
412262,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34
412263,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09

In [266]:
# initial table analysis to get familiar
display(table_3.head(), f"Table shape: {table_3.shape}", table_3.dtypes)

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

'Table shape: (755405, 5)'

client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object

In [268]:
table_3['process_step'].unique()

array(['step_3', 'step_2', 'step_1', 'start', 'confirm'], dtype=object)

In [270]:
# handle the missing values in table_1

In [272]:
# Fill NaN values in categorical columns with 'undefined'
table_1['gendr'] = table_1['gendr'].fillna('undefined')
table_1.isna().sum()

client_id            0
clnt_tenure_yr      14
clnt_tenure_mnth    14
clnt_age            15
gendr                0
num_accts           14
bal                 14
calls_6_mnth        14
logons_6_mnth       14
dtype: int64

In [274]:
table_1 = table_1.dropna(subset=['clnt_tenure_yr', 'clnt_tenure_mnth', 'clnt_age', 'num_accts', 'bal', 'calls_6_mnth', 'logons_6_mnth'])
display(table_1.isna().sum())

client_id           0
clnt_tenure_yr      0
clnt_tenure_mnth    0
clnt_age            0
gendr               0
num_accts           0
bal                 0
calls_6_mnth        0
logons_6_mnth       0
dtype: int64

In [276]:
# handle the missing values in table 2 => transform the NaN to Undefined

In [278]:
table_2['Variation'].unique()

array(['Test', 'Control', nan], dtype=object)

In [280]:
# Replace NaN values with 'undefined'
table_2.fillna('undefined', inplace=True)
display(table_2.head(), table_2.isna().sum())

   client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

client_id    0
Variation    0
dtype: int64

In [282]:
# date and time parsing in table_3
table_3['date_time'] = pd.to_datetime(table_3['date_time'], format='%Y-%m-%d %H:%M:%S', errors='coerce')

In [284]:
# Extract year, date, and time from 'date_time' column
table_3['year'] = table_3['date_time'].dt.year
table_3['date'] = pd.to_datetime(table_3['date_time'].dt.date, format='%Y-%m-%d', errors='coerce')
table_3['time'] = pd.to_datetime(table_3['date_time'].dt.time.astype(str), format='%H:%M:%S', errors='coerce').dt.time

In [285]:
# Display the updated table with the new columns
display(table_3.head())

,client_id,visitor_id,visit_id,process_step,date_time,year,date,time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07,2017,2017-04-17,15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51,2017,2017-04-17,15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22,2017,2017-04-17,15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13,2017,2017-04-17,15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04,2017,2017-04-17,15:18:04

In [288]:
display(table_3.dtypes)

client_id                int64
visitor_id              object
visit_id                object
process_step            object
date_time       datetime64[ns]
year                     int32
date            datetime64[ns]
time                    object
dtype: object

create a copy of the cleaned tables

In [293]:
# create a copy of the cleaned data
table_1.to_csv('table_1.csv', index=False)
table_2.to_csv('table_2.csv', index=False)
table_3.to_csv('table_3.csv', index=False)

## Check numerical details on table_1, table_2 & table_3

In [297]:
display(table_1.describe())

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,num_accts,bal,calls_6_mnth,logons_6_mnth
count,7.059400e+04,70594.000000,70594.000000,70594.000000,70594.000000,7.059400e+04,70594.000000,70594.000000
mean,5.005026e+06,12.053007,150.659999,46.442240,2.255532,1.474467e+05,3.382469,5.566720
std,2.877289e+06,6.871850,82.090264,15.591273,0.535000,3.015106e+05,2.236595,2.353296
min,1.690000e+02,2.000000,33.000000,13.500000,1.000000,1.378942e+04,0.000000,1.000000
25%,2.519543e+06,6.000000,82.000000,32.500000,2.000000,3.734660e+04,1.000000,4.000000
50%,5.016974e+06,11.000000,136.000000,47.000000,2.000000,6.333459e+04,3.000000,5.000000
75%,7.483074e+06,16.000000,192.000000,59.000000,2.000000,1.375461e+05,6.000000,7.000000
max,9.999839e+06,62.000000,749.000000,96.000000,8.000000,1.632004e+07,7.000000,9.000000

In [299]:
display(table_2.describe())

          client_id
count  7.060900e+04
mean   5.004992e+06
std    2.877278e+06
min    1.690000e+02
25%    2.519329e+06
50%    5.016978e+06
75%    7.483085e+06
max    9.999839e+06

In [301]:
display(table_3.describe())

,client_id,date_time,year,date
count,7.554050e+05,755405,755405.0,755405
mean,5.013632e+06,2017-05-07 22:36:27.471852544,2017.0,2017-05-07 08:17:44.647440896
min,1.690000e+02,2017-03-15 00:03:03,2017.0,2017-03-15 00:00:00
25%,2.519882e+06,2017-04-08 21:14:52,2017.0,2017-04-08 00:00:00
50%,5.033441e+06,2017-05-11 16:47:34,2017.0,2017-05-11 00:00:00
75%,7.496063e+06,2017-06-03 11:02:51,2017.0,2017-06-03 00:00:00
max,9.999875e+06,2017-06-20 23:59:57,2017.0,2017-06-20 00:00:00
std,2.879152e+06,NaN,0.0,NaN

## Joining tables

In [304]:
display(table_1, table_2, table_3)

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0
...,...,...,...,...,...,...,...,...,...
70604,7993686,4.0,56.0,38.5,U,3.0,1411062.68,5.0,5.0
70605,8981690,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0
70606,333913,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0
70607,1573142,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0
70608,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0

       client_id  Variation
0        9988021       Test
1        8320017       Test
2        4033851    Control
3        1982004       Test
4        9294070    Control
...          ...        ...
70604    2443347  undefined
70605    8788427  undefined
70606     266828  undefined
70607    1266421  undefined
70608    9895983  undefined

[70609 rows x 2 columns]

,client_id,visitor_id,visit_id,process_step,date_time,year,date,time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07,2017,2017-04-17,15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51,2017,2017-04-17,15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22,2017,2017-04-17,15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13,2017,2017-04-17,15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04,2017,2017-04-17,15:18:04
...,...,...,...,...,...,...,...,...
412259,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10,2017,2017-05-24,18:46:10
412260,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29,2017,2017-05-24,18:45:29
412261,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51,2017,2017-05-24,18:44:51
412262,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34,2017,2017-05-24,18:44:34
412263,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09,2017,2017-06-03,12:17:09

In [306]:
# Merge 1: Merge table_1 with table_2 using an inner join and client_id as matching
merged_df_1 = pd.merge(table_1, table_2, on='client_id', how='inner')
display(merged_df_1)

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth,Variation
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0,Test
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0,Control
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0,Test
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0,Test
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0,Control
...,...,...,...,...,...,...,...,...,...,...
70589,7993686,4.0,56.0,38.5,U,3.0,1411062.68,5.0,5.0,undefined
70590,8981690,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0,undefined
70591,333913,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0,undefined
70592,1573142,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0,undefined
70593,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0,undefined

In [308]:
# Merge 2: Merge the new table with table_3
final_df = pd.merge(merged_df_1, table_3, on='client_id', how='inner')
display(final_df, final_df.isna().sum(), final_df.describe())

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth,Variation,visitor_id,visit_id,process_step,date_time,year,date,time
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0,Test,427070339_1413275162,228976764_46825473280_96584,confirm,2017-04-02 11:51:13,2017,2017-04-02,11:51:13
1,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0,Test,427070339_1413275162,228976764_46825473280_96584,confirm,2017-04-02 11:47:50,2017,2017-04-02,11:47:50
2,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0,Test,427070339_1413275162,228976764_46825473280_96584,confirm,2017-04-02 11:46:45,2017,2017-04-02,11:46:45
3,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0,Test,427070339_1413275162,228976764_46825473280_96584,step_3,2017-04-02 11:23:08,2017,2017-04-02,11:23:08
4,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0,Test,427070339_1413275162,228976764_46825473280_96584,step_2,2017-04-02 11:22:24,2017,2017-04-02,11:22:24
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
449699,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0,undefined,962766819_57063135389,158544612_4105226940_43043,confirm,2017-04-05 11:48:02,2017,2017-04-05,11:48:02
449700,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0,undefined,962766819_57063135389,158544612_4105226940_43043,step_3,2017-04-05 11:44:07,2017,2017-04-05,11:44:07
449701,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0,undefined,962766819_57063135389,158544612_4105226940_43043,step_2,2017-04-05 11:43:10,2017,2017-04-05,11:43:10
449702,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0,undefined,962766819_57063135389,884309593_49820690623_654151,step_1,2017-04-05 11:41:32,2017,2017-04-05,11:41:32
449703,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0,undefined,962766819_57063135389,884309593_49820690623_654151,start,2017-04-05 11:41:04,2017,2017-04-05,11:41:04

client_id           0
clnt_tenure_yr      0
clnt_tenure_mnth    0
clnt_age            0
gendr               0
num_accts           0
bal                 0
calls_6_mnth        0
logons_6_mnth       0
Variation           0
visitor_id          0
visit_id            0
process_step        0
date_time           0
year                0
date                0
time                0
dtype: int64

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,num_accts,bal,calls_6_mnth,logons_6_mnth,date_time,year,date
count,4.497040e+05,449704.000000,449704.000000,449704.000000,449704.000000,4.497040e+05,449704.000000,449704.000000,449704,449704.0,449704
mean,5.002904e+06,12.234243,152.812170,47.653966,2.264774,1.597768e+05,3.529164,5.709842,2017-04-20 03:14:02.904747776,2017.0,2017-04-19 12:55:32.047746816
min,1.690000e+02,2.000000,33.000000,13.500000,1.000000,1.378942e+04,0.000000,1.000000,2017-03-15 00:03:03,2017.0,2017-03-15 00:00:00
25%,2.515588e+06,6.000000,82.000000,33.500000,2.000000,3.844610e+04,2.000000,4.000000,2017-04-04 16:32:00.750000128,2017.0,2017-04-04 00:00:00
50%,5.025355e+06,11.000000,139.000000,49.000000,2.000000,6.677571e+04,3.000000,6.000000,2017-04-12 14:17:54.500000,2017.0,2017-04-12 00:00:00
75%,7.468377e+06,16.000000,194.000000,60.000000,2.000000,1.490039e+05,6.000000,8.000000,2017-04-30 22:24:37.249999872,2017.0,2017-04-30 00:00:00
max,9.999839e+06,62.000000,749.000000,96.000000,8.000000,1.632004e+07,7.000000,9.000000,2017-06-20 23:57:06,2017.0,2017-06-20 00:00:00
std,2.873056e+06,7.005242,83.720383,15.742089,0.543080,3.420734e+05,2.242500,2.356200,NaN,0.0,NaN

In [310]:
final_df.to_csv('final_df.csv', index=False)